package com.game.textadventure

import androidx.lifecycle.ViewModel

class dataViewmodel: ViewModel()  {
    public val storyArray= arrayOf(
        arrayOf("이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리",
            "이것은 두번 째 스토리이것은 두번 째 스토리이것은 두번 째 스토리이것은 두번 째 스토리이것은 두번 째 스토리이것은 두번 째 스토리이것은 두번 째 스토리이것은 두번 째 스토리이것은 두번 째 스토리",
            "이것은 세번 째 스토리이것은 세번 째 스토리이것은 세번 째 스토리이것은 세번 째 스토리이것은 세번 째 스토리이것은 세번 째 스토리이것은 세번 째 스토리이것은 세번 째 스토리이것은 세번 째 스토리"),
        arrayOf("cat", "dog", "bird"),
        arrayOf("red", "green", "blue")
    )

    public val selectArray= arrayOf(
        arrayOf("이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리이것은 첫번 째 스토리",
            "이것은 두번 째 스토리이것은 두번 째 스토리이것은 두번 째 스토리이것은 두번 째 스토리이것은 두번 째 스토리이것은 두번 째 스토리이것은 두번 째 스토리이것은 두번 째 스토리이것은 두번 째 스토리",
            "이것은 세번 째 스토리이것은 세번 째 스토리이것은 세번 째 스토리이것은 세번 째 스토리이것은 세번 째 스토리이것은 세번 째 스토리이것은 세번 째 스토리이것은 세번 째 스토리이것은 세번 째 스토리"),
        arrayOf("cat", "dog", "bird"),
        arrayOf("red", "green", "blue")
    )
}